In [1]:
import pandas as pd

In [2]:
# pd.set_option('display.max_rows', None)
# pd.set_option('display.max_columns', None)

In [3]:
df = pd.read_csv("D:\\EduNet\\NSTI_Indore25_26\\Data Science\\Student Marks.csv")

In [4]:
df

   Sno Student Name   Marks  Total      Phone
0    1            A  5.0000     10    2341234
1    2            B  7.0000     10   23421422
2    3            C  8.5555     10     234242
3    4            D  6.0000     10      23424
4    5            E  7.0000     10  242342342

In [5]:
df[['Phone','Sno']]

       Phone  Sno
0    2341234    1
1   23421422    2
2     234242    3
3      23424    4
4  242342342    5

In [6]:
df['Percent'] = (df['Marks']/df['Total'])*100

In [7]:
df

   Sno Student Name   Marks  Total      Phone  Percent
0    1            A  5.0000     10    2341234   50.000
1    2            B  7.0000     10   23421422   70.000
2    3            C  8.5555     10     234242   85.555
3    4            D  6.0000     10      23424   60.000
4    5            E  7.0000     10  242342342   70.000

In [8]:
df.to_csv("D:\\EduNet\\NSTI_Indore25_26\\Data Science\\UpdatedStudent.csv")

In [9]:
df = pd.read_excel("D:\\EduNet\\NSTI_Indore25_26\\Data Science\\Shop-Records 1.xlsx")
df

     Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
0            101             A           IN          10       800   201901
1            102             B           FR          11       104   201901
2            103             C           US          12       300   201901
3            104             D           IT          13       240   201901
4            105             E           MY          14       321   201901
..           ...           ...          ...         ...       ...      ...
99           200             V           IT          20       298   202011
100          201             W           TH          10       283   202012
101          202             X           US          11       593   202012
102          203             Y           FR          12       296   202012
103          204             Z           FR          13       519   202012

[104 rows x 6 columns]

In [10]:
df.head(25)

    Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
0           101             A           IN          10       800   201901
1           102             B           FR          11       104   201901
2           103             C           US          12       300   201901
3           104             D           IT          13       240   201901
4           105             E           MY          14       321   201901
5           106             F           UK          15       105   201902
6           107             G           AU          16       503   201902
7           108             H           TH          17       438   201902
8           109             I           NZ          18       352   201902
9           110             J           IN          19       678   201902
10          111             K           RU          20       424   201903
11          112             L           IN          10       965   201903
12          113             M           US          11       236   201903
13          114             N           FR          12       463   201903
14          115             O           NZ          13       198   201903
15          116             P           TH          14       673   201904
16          117             Q           AU          15       392   201904
17          118             R           IN          16       851   201904
18          119             S           MY          17       425   201904
19          120             T           JP          18       294   201904
20          121             U           KW          19       383   201905
21          122             V           IT          20       298   201905
22          123             W           TH          10       283   201905
23          124             X           US          11       593   201905
24          125             Y           FR          12       296   201906

In [11]:
df.tail(25)

     Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
79           180             B           FR          11       104   202006
80           181             C           US          12       300   202006
81           182             D           IT          13       240   202006
82           183             E           MY          14       321   202007
83           184             F           UK          15       105   202007
84           185             G           AU          16       503   202007
85           186             H           TH          17       438   202008
86           187             I           NZ          18       352   202008
87           188             J           IN          19       678   202008
88           189             K           RU          20       424   202009
89           190             L           IN          10       965   202009
90           191             M           US          11       236   202009
91           192             N           FR          12       463   202009
92           193             O           NZ          13       198   202010
93           194             P           TH          14       673   202010
94           195             Q           AU          15       392   202010
95           196             R           IN          16       851   202010
96           197             S           MY          17       425   202011
97           198             T           JP          18       294   202011
98           199             U           KW          19       383   202011
99           200             V           IT          20       298   202011
100          201             W           TH          10       283   202012
101          202             X           US          11       593   202012
102          203             Y           FR          12       296   202012
103          204             Z           FR          13       519   202012

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_ID    104 non-null    int64
 1   Customer_Name  104 non-null    object
 2   Country_Code   104 non-null    object
 3   Product_ID     104 non-null    int64
 4   Quantity       104 non-null    int64
 5   Date_ID        104 non-null    int64
dtypes: int64(4), object(2)
memory usage: 5.0+ KB

In [13]:
df.describe()

       Customer_ID  Product_ID    Quantity        Date_ID
count   104.000000  104.000000  104.000000     104.000000
mean    152.500000   14.461538  428.230769  201952.519231
std      30.166206    3.216834  217.249766      50.167289
min     101.000000   10.000000  104.000000  201901.000000
25%     126.750000   12.000000  294.000000  201906.000000
50%     152.500000   14.000000  387.500000  201911.500000
75%     178.250000   17.000000  519.000000  202005.250000
max     204.000000   20.000000  965.000000  202012.000000

In [14]:
att = pd.read_csv("D:\\EduNet\\NSTI_Indore25_26\\Data Science\\attendance.csv")
att

    Sno                Name  Attendance  Present  Total
0     1        Aditi Sharma          67       60     89
1     2     Anuradha Baghel          97       68     70
2     3     Dakshita Dayoda          46       41     89
3     4   Divyanshi Kushwah         100       89     89
4     5        Gouri Gurjar          98       87     89
5     6                Isha          57       51     89
6     7         Jyoti Verma          78       69     89
7     8  Karishma Narvariya          96       85     89
8     9     Kashvi Bhandari          60       53     89
9    10        Khushi Patil          74       66     89
10   11         Komal Devda          62       55     89
11   12          Meherkajal          93       83     89
12   13      Parul Makoriya          62       55     71
13   14       Prachi Gehlot          99       76     77
14   15     Priyanka Rajput          91       81     89
15   16     Safalta Kaushal          97       77     79
16   17        Sherlyn Naik          92       82     89
17   18        Somya Kapade          96       85     89
18   19          Vani Gupta         100       69     69

In [15]:
li = ['Name','Present','Total']
att[li]

                  Name  Present  Total
0         Aditi Sharma       60     89
1      Anuradha Baghel       68     70
2      Dakshita Dayoda       41     89
3    Divyanshi Kushwah       89     89
4         Gouri Gurjar       87     89
5                 Isha       51     89
6          Jyoti Verma       69     89
7   Karishma Narvariya       85     89
8      Kashvi Bhandari       53     89
9         Khushi Patil       66     89
10         Komal Devda       55     89
11          Meherkajal       83     89
12      Parul Makoriya       55     71
13       Prachi Gehlot       76     77
14     Priyanka Rajput       81     89
15     Safalta Kaushal       77     79
16        Sherlyn Naik       82     89
17        Somya Kapade       85     89
18          Vani Gupta       69     69

In [16]:
#att.iloc[19]['Name']

In [17]:
att.iloc[5:15]

    Sno                Name  Attendance  Present  Total
5     6                Isha          57       51     89
6     7         Jyoti Verma          78       69     89
7     8  Karishma Narvariya          96       85     89
8     9     Kashvi Bhandari          60       53     89
9    10        Khushi Patil          74       66     89
10   11         Komal Devda          62       55     89
11   12          Meherkajal          93       83     89
12   13      Parul Makoriya          62       55     71
13   14       Prachi Gehlot          99       76     77
14   15     Priyanka Rajput          91       81     89

In [18]:
"Aditi"[0:3].upper()

'ADI'

In [19]:
att['ID'] = att['Name'].apply(lambda x: x[0:3].upper())
att

    Sno                Name  Attendance  Present  Total   ID
0     1        Aditi Sharma          67       60     89  ADI
1     2     Anuradha Baghel          97       68     70  ANU
2     3     Dakshita Dayoda          46       41     89  DAK
3     4   Divyanshi Kushwah         100       89     89  DIV
4     5        Gouri Gurjar          98       87     89  GOU
5     6                Isha          57       51     89  ISH
6     7         Jyoti Verma          78       69     89  JYO
7     8  Karishma Narvariya          96       85     89  KAR
8     9     Kashvi Bhandari          60       53     89  KAS
9    10        Khushi Patil          74       66     89  KHU
10   11         Komal Devda          62       55     89  KOM
11   12          Meherkajal          93       83     89  MEH
12   13      Parul Makoriya          62       55     71  PAR
13   14       Prachi Gehlot          99       76     77  PRA
14   15     Priyanka Rajput          91       81     89  PRI
15   16     Safalta Kaushal          97       77     79  SAF
16   17        Sherlyn Naik          92       82     89  SHE
17   18        Somya Kapade          96       85     89  SOM
18   19          Vani Gupta         100       69     69  VAN

In [20]:
att.drop("ID",axis=1,inplace=True)

In [21]:
att[att['Attendance']<80]

    Sno             Name  Attendance  Present  Total
0     1     Aditi Sharma          67       60     89
2     3  Dakshita Dayoda          46       41     89
5     6             Isha          57       51     89
6     7      Jyoti Verma          78       69     89
8     9  Kashvi Bhandari          60       53     89
9    10     Khushi Patil          74       66     89
10   11      Komal Devda          62       55     89
12   13   Parul Makoriya          62       55     71

In [22]:
att[att['Total'] != 89]

    Sno             Name  Attendance  Present  Total
1     2  Anuradha Baghel          97       68     70
12   13   Parul Makoriya          62       55     71
13   14    Prachi Gehlot          99       76     77
15   16  Safalta Kaushal          97       77     79
18   19       Vani Gupta         100       69     69

In [23]:
df

     Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
0            101             A           IN          10       800   201901
1            102             B           FR          11       104   201901
2            103             C           US          12       300   201901
3            104             D           IT          13       240   201901
4            105             E           MY          14       321   201901
..           ...           ...          ...         ...       ...      ...
99           200             V           IT          20       298   202011
100          201             W           TH          10       283   202012
101          202             X           US          11       593   202012
102          203             Y           FR          12       296   202012
103          204             Z           FR          13       519   202012

[104 rows x 6 columns]

In [24]:
df.sort_values('Country_Code',ascending=True)

    Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
16          117             Q           AU          15       392   201904
42          143             Q           AU          15       392   201910
58          159             G           AU          16       503   202001
68          169             Q           AU          15       392   202003
84          185             G           AU          16       503   202007
..          ...           ...          ...         ...       ...      ...
90          191             M           US          11       236   202009
80          181             C           US          12       300   202006
54          155             C           US          12       300   201912
2           103             C           US          12       300   201901
49          150             X           US          11       593   201911

[104 rows x 6 columns]

In [25]:
df['Country_Code'].unique()
df.sort_values(
    by=['Country_Code','Quantity'],
    ascending=[True,False]
    )

    Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
6           107             G           AU          16       503   201902
32          133             G           AU          16       503   201907
58          159             G           AU          16       503   202001
84          185             G           AU          16       503   202007
16          117             Q           AU          15       392   201904
..          ...           ...          ...         ...       ...      ...
80          181             C           US          12       300   202006
12          113             M           US          11       236   201903
38          139             M           US          11       236   201909
64          165             M           US          11       236   202003
90          191             M           US          11       236   202009

[104 rows x 6 columns]

In [26]:
employee =pd.read_csv("D:\\EduNet\\NSTI_Indore25_26\\Data Science\\large_employees_dataset.csv") 
employee

,EmployeeID,Name,Department,Age,Salary,JoinDate,Email,ManagerID
0,1001,Brent Mendoza,IT,37.0,68000.0,2024-06-06,mirandanichols@example.net,2005.0
1,1002,Austin Castro,NaN,40.0,64000.0,2017-12-31,olivia07@example.com,2004.0
2,1003,Whitney Johnson,Finance,55.0,50000.0,2024-01-21,piercenicole@example.org,2032.0
3,1004,Michael Jones,IT,35.0,88000.0,2020-07-04,garrettheather@example.com,NaN
4,1005,Abigail Santos,Sales,56.0,77000.0,2023-04-28,stephaniegraves@example.net,2026.0
...,...,...,...,...,...,...,...,...
4995,5996,Christina Malone,Marketing,55.0,92000.0,2022-07-15,ericcook@example.net,NaN
4996,5997,Eric Jones,Sales,57.0,50000.0,NaN,wrightbrian@example.net,2039.0
4997,5998,John Dean,HR,59.0,39000.0,2025-01-26,stewartdale@example.org,2002.0
4998,5999,Connie Bailey,Marketing,37.0,95000.0,2020-06-24,gateslinda@example.org,2021.0
4999,6000,Sergio Moss,IT,30.0,57000.0,2021-01-30,obenitez@example.org,2014.0

In [27]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  5000 non-null   int64
 1   Name        5000 non-null   object
 2   Department  4521 non-null   object
 3   Age         4874 non-null   float64
 4   Salary      4796 non-null   float64
 5   JoinDate    4756 non-null   object
 6   Email       4506 non-null   object
 7   ManagerID   4781 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 312.6+ KB

In [28]:
employee.isna().sum()

EmployeeID      0
Name            0
Department    479
Age           126
Salary        204
JoinDate      244
Email         494
ManagerID     219
dtype: int64

In [29]:
employee.sort_values('Email',na_position='first')

,EmployeeID,Name,Department,Age,Salary,JoinDate,Email,ManagerID
11,1012,Jason Pham,NaN,49.0,99000.0,2024-01-19,NaN,2027.0
27,1028,Stephen Stein,IT,24.0,114000.0,2019-12-09,NaN,2047.0
34,1035,Tina Johnson,NaN,28.0,93000.0,2024-05-19,NaN,2042.0
39,1040,Jerry Thompson,IT,58.0,43000.0,2018-02-23,NaN,2044.0
44,1045,Duane Carr,HR,46.0,102000.0,2017-03-05,NaN,2004.0
...,...,...,...,...,...,...,...,...
3702,4703,Christopher Kline,HR,34.0,100000.0,2024-09-26,zwhite@example.com,2043.0
3116,4117,Brooke Miles,Finance,50.0,64000.0,2017-11-06,zwilkerson@example.net,2014.0
3564,4565,Kaitlyn Guerra,IT,41.0,70000.0,2025-03-10,zwilliams@example.net,2029.0
3313,4314,Robert Stone DDS,Sales,45.0,91000.0,2019-04-27,zwilliams@example.org,2020.0
1695,2696,Betty Wilkinson,Sales,51.0,64000.0,2019-10-13,zyoung@example.net,2006.0

In [30]:
from pandas.api.types import CategoricalDtype
size = ['xs','s','m','l','xl','xxl','xxxl']
size_dtype = CategoricalDtype(categories=size,ordered=True)
print(sorted(size))

['l', 'm', 's', 'xl', 'xs', 'xxl', 'xxxl']

In [31]:
clothsize = {
    'size': ['s','l','m','xl','xs'],
    'quantity': [20,10,30,10,5]
}

dfShirt = pd.DataFrame(clothsize)
dfShirt.sort_values(by='size')

  size  quantity
1    l        10
2    m        30
0    s        20
3   xl        10
4   xs         5

In [32]:
dfShirt['size'] =dfShirt['size'].astype(size_dtype)

In [33]:
dfShirt.sort_values(by=['size'])

  size  quantity
4   xs         5
0    s        20
2    m        30
1    l        10
3   xl        10

In [34]:
listOfIndex = [['A', 'B', 'A', 'B', 'A', 'B'],
         [1, 3, 2, 3, 1, 2]]
index = pd.MultiIndex.from_arrays(listOfIndex,names=('Section','Roll'))

student ={
    'name':['Ram','Shyam','Ramesh','Suresh','Rohan','Mohan']
}


studentDF= pd.DataFrame(student,index=index)
studentDF

                name
Section Roll
A       1        Ram
B       3      Shyam
A       2     Ramesh
B       3     Suresh
A       1      Rohan
B       2      Mohan

In [35]:
studentDF.sort_index(level='Section')

                name
Section Roll
A       1        Ram
        1      Rohan
        2     Ramesh
B       2      Mohan
        3      Shyam
        3     Suresh

In [ ]:
AverageQuantityPerCountry = df.groupby(['Country_Code'])['Quantity'].mean()

In [ ]:
type(AverageQuantityPerCountry)

pandas.core.series.Series

In [51]:
df.groupby('Country_Code')['Quantity'].mean()

Country_Code
AU    447.500000
FR    320.714286
IN    805.588235
IT    269.000000
JP    339.000000
KW    383.000000
MY    373.000000
NZ    275.000000
RU    424.000000
TH    464.666667
UK    105.000000
US    376.333333
Name: Quantity, dtype: float64

In [52]:
df.groupby('Country_Code')['Quantity'].sum()

Country_Code
AU     3580
FR     4490
IN    13695
IT     2152
JP     1695
KW     1532
MY     2984
NZ     2200
RU     1696
TH     5576
UK      420
US     4516
Name: Quantity, dtype: int64

In [53]:
df.groupby('Country_Code')['Quantity'].std()

Country_Code
AU     59.331996
FR    164.063510
IN    126.804504
IT     31.002304
JP    100.623059
KW      0.000000
MY     55.590338
NZ     82.316463
RU      0.000000
TH    167.458724
UK      0.000000
US    162.329258
Name: Quantity, dtype: float64

In [54]:
df

     Customer_ID Customer_Name Country_Code  Product_ID  Quantity  Date_ID
0            101             A           IN          10       800   201901
1            102             B           FR          11       104   201901
2            103             C           US          12       300   201901
3            104             D           IT          13       240   201901
4            105             E           MY          14       321   201901
..           ...           ...          ...         ...       ...      ...
99           200             V           IT          20       298   202011
100          201             W           TH          10       283   202012
101          202             X           US          11       593   202012
102          203             Y           FR          12       296   202012
103          204             Z           FR          13       519   202012

[104 rows x 6 columns]

In [56]:
data = {
    "EmployeeID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110,
                   111, 112, 113, 114, 115, 116, 117, 118, 119, 120],

    "Name": ["Amit", "Neha", "Rohit", "Pooja", "Karan", "Sneha", "Vikas", "Anjali", "Manoj", "Riya",
             "Deepak", "Kavita", "Suresh", "Meena", "Arjun", "Nidhi", "Rahul", "Simran", "Yogesh", "Isha"],

    "Department": ["IT", "HR", "IT", "Sales", "Sales", "HR", "IT", "Marketing", "Marketing", "Sales",
                   "HR", "IT", "Sales", "Marketing", "IT", "HR", "Sales", "Marketing", "IT", "HR"],

    "Region": ["North", "South", "East", "West", "North", "South", "East", "West", "North", "South",
               "East", "West", "North", "South", "East", "West", "North", "South", "East", "West"],

    "Age": [25, 28, 30, 27, 35, 26, 29, 31, 34, 24,
            32, 28, 36, 33, 27, 29, 31, 26, 34, 28],

    "Experience_Years": [2, 4, 6, 3, 10, 3, 5, 7, 9, 1,
                         8, 4, 11, 9, 3, 5, 7, 2, 10, 4],

    "Salary": [35000, 42000, 55000, 38000, 75000, 40000, 52000, 60000, 70000, 32000,
               65000, 45000, 80000, 72000, 39000, 50000, 68000, 36000, 77000, 43000],

    "Monthly_Sales": [0, 0, 0, 120000, 150000, 0, 0, 90000, 110000, 130000,
                      0, 0, 160000, 95000, 0, 0, 140000, 88000, 0, 0],

    "Target_Achieved_Percent": [0, 0, 0, 85, 90, 0, 0, 78, 88, 92,
                                0, 0, 95, 80, 0, 0, 89, 75, 0, 0],

    "Working_Hours_Per_Week": [40, 38, 42, 45, 48, 37, 41, 44, 46, 39,
                               43, 40, 49, 47, 38, 41, 45, 36, 48, 39],

    "Leaves_Taken": [2, 1, 3, 0, 1, 2, 1, 0, 2, 1,
                     3, 2, 0, 1, 2, 1, 0, 3, 1, 2]
}

employee = pd.DataFrame(data)
employee

,EmployeeID,Name,Department,Region,Age,Experience_Years,Salary,Monthly_Sales,Target_Achieved_Percent,Working_Hours_Per_Week,Leaves_Taken
0,101,Amit,IT,North,25,2,35000,0,0,40,2
1,102,Neha,HR,South,28,4,42000,0,0,38,1
2,103,Rohit,IT,East,30,6,55000,0,0,42,3
3,104,Pooja,Sales,West,27,3,38000,120000,85,45,0
4,105,Karan,Sales,North,35,10,75000,150000,90,48,1
5,106,Sneha,HR,South,26,3,40000,0,0,37,2
6,107,Vikas,IT,East,29,5,52000,0,0,41,1
7,108,Anjali,Marketing,West,31,7,60000,90000,78,44,0
8,109,Manoj,Marketing,North,34,9,70000,110000,88,46,2
9,110,Riya,Sales,South,24,1,32000,130000,92,39,1
10,111,Deepak,HR,East,32,8,65000,0,0,43,3
11,112,Kavita,IT,West,28,4,45000,0,0,40,2
12,113,Suresh,Sales,North,36,11,80000,160000,95,49,0
13,114,Meena,Marketing,South,33,9,72000,95000,80,47,1
14,115,Arjun,IT,East,27,3,39000,0,0,38,2
15,116,Nidhi,HR,West,29,5,50000,0,0,41,1
16,117,Rahul,Sales,North,31,7,68000,140000,89,45,0
17,118,Simran,Marketing,South,26,2,36000,88000,75,36,3
18,119,Yogesh,IT,East,34,10,77000,0,0,48,1
19,120,Isha,HR,West,28,4,43000,0,0,39,2

In [ ]:
# Q1. Department-wise Average Salary
employee.groupby(['Department'])['Salary'].mean()

Department
HR           48000.0
IT           50500.0
Marketing    59500.0
Sales        58600.0
Name: Salary, dtype: float64

In [59]:
employee.groupby('Department')['Monthly_Sales'].sum()

Department
HR                0
IT                0
Marketing    383000
Sales        700000
Name: Monthly_Sales, dtype: int64

In [60]:
employee.groupby(['Department','Region'])['Monthly_Sales'].mean()

Department  Region
HR          East           0.0
            South          0.0
            West           0.0
IT          East           0.0
            North          0.0
            West           0.0
Marketing   North     110000.0
            South      91500.0
            West       90000.0
Sales       North     150000.0
            South     130000.0
            West      120000.0
Name: Monthly_Sales, dtype: float64

In [62]:
# Q2. Region-wise Total Monthly Sales
employee.groupby('Region')['Monthly_Sales'].sum()

Region
East          0
North    560000
South    313000
West     210000
Name: Monthly_Sales, dtype: int64

In [63]:
# Q3 Department-wise Maximum Experience
employee.groupby('Department')['Experience_Years'].max()

Department
HR            8
IT           10
Marketing     9
Sales        11
Name: Experience_Years, dtype: int64

In [64]:
# Q4. Region & Department-wise Average Working Hours
employee.groupby(['Region','Department'])['Working_Hours_Per_Week'].mean()

Region  Department
East    HR            43.000000
        IT            42.250000
North   IT            40.000000
        Marketing     46.000000
        Sales         47.333333
South   HR            37.500000
        Marketing     41.500000
        Sales         39.000000
West    HR            40.000000
        IT            40.000000
        Marketing     44.000000
        Sales         45.000000
Name: Working_Hours_Per_Week, dtype: float64

In [68]:
# Q5. Department-wise Total Leaves Taken
employee.groupby('Department')['Leaves_Taken'].sum()

Department
HR            9
IT           11
Marketing     6
Sales         2
Name: Leaves_Taken, dtype: int64

In [ ]:
employee.groupby('Department')['Leaves_Taken'].max()

Department
HR           3
IT           3
Marketing    3
Sales        1
Name: Leaves_Taken, dtype: int64

In [70]:
employee.groupby('Department')['Leaves_Taken'].min()

Department
HR           1
IT           1
Marketing    0
Sales        0
Name: Leaves_Taken, dtype: int64